In [2]:
import numpy as np
import pandas as pd

In [3]:
list =  [12, 15, 14, 17, 21, 24, 28, 26, 22, 19, 16, 13]

In [4]:
#1. Étendue
MAX=max(list) 
MIN=min(list)
Etendue =  MAX - MIN
print("Etendue de La List est :",Etendue)

Etendue de La List est : 16

In [5]:
#2. Variance
DEV103 = [18, 19, 17, 20, 18, 19, 17, 18, 20, 19, 16, 20, 17, 19, 18, 20, 19, 17, 19, 18]
DEV105 = [12, 14, 13, 15, 11, 13, 14, 12, 15, 13, 11, 12, 14, 13, 12, 11, 15, 13, 14, 12]
print(" La Variance de DEV103 est :",np.var(DEV103))
print(" La Variance de DEV105 est :",np.var(DEV105))

 La Variance de DEV103 est : 1.3400000000000003
 La Variance de DEV105 est : 1.6475000000000002

In [6]:
data = {
    'Poste': ['Ingénieur Senior', 'Ingénieur Confirmé', 'Ingénieur Junior', 'Ingénieur Débutant', 'Ingénieur en Formation',
              'Technicien Expert', 'Technicien Senior', 'Technicien Confirmé', 'Technicien Junior', 'Technicien Débutant',
              'Technicien en Formation', 'Assistant Technique', 'Apprenti Technicien', 'Stagiaire Technique'],
    'Salaire Mensuel (en MAD)': [12986, 11458, 9167, 7639, 6875, 6111, 5347, 4583, 3820, 3361, 3056, 2750, 2445, 1667]
}

df = pd.DataFrame(data)
df

                      Poste  Salaire Mensuel (en MAD)
0          Ingénieur Senior                     12986
1        Ingénieur Confirmé                     11458
2          Ingénieur Junior                      9167
3        Ingénieur Débutant                      7639
4    Ingénieur en Formation                      6875
5         Technicien Expert                      6111
6         Technicien Senior                      5347
7       Technicien Confirmé                      4583
8         Technicien Junior                      3820
9       Technicien Débutant                      3361
10  Technicien en Formation                      3056
11      Assistant Technique                      2750
12      Apprenti Technicien                      2445
13      Stagiaire Technique                      1667

In [7]:
print("Écart-type est :",np.std(df['Salaire Mensuel (en MAD)']))

Écart-type est : 3341.806432095048

In [8]:
quartiles = np.percentile(df['Salaire Mensuel (en MAD)'], [25, 50, 75])
print("Quartiles est :", quartiles)

Quartiles est : [3132.25 4965.   7448.  ]

In [12]:
df = pd.read_excel(r"C:\Users\Lenovo\Desktop\Project Aymen\Les TP\Activités Pratiques en Python et Excel\Table.xlsx")
df.head(5)

,Profession,revenu mensuel min,revenu mensuel max
0,Salarié dans le secteur public (fonctionnaire),4000,12000
1,Employé dans le secteur privé (niveau débutant),5000,8000
2,Employé dans le secteur privé (niveau interméd...,8000,15000
3,Employé dans le secteur privé (niveau senior),15000,30000
4,Médecin généraliste,20000,50000

In [27]:
deciles_Min = np.percentile(df['revenu mensuel min'], np.arange(0, 101, 10))
deciles_Max = np.percentile(df['revenu mensuel max'], np.arange(0, 101, 10))
print("Deciles revenu mensuel max :" ,deciles_Min)
print("Decile de revenu mensuel min : ", deciles_Max)

Deciles revenu mensuel max : [ 3000.  6000.  8000. 10000. 10000. 12000. 12000. 15000. 15000. 20000.
 30000.]
Decile de revenu mensuel min :  [ 8000. 12000. 19200. 20000. 25000. 25000. 25000. 30000. 30000. 40000.
 80000.]